# Индивидуальное задание
# Вариант 20
# Чумакова Оксана ЭУ-142
# Задача №1
print('Индивидуальное задание. Задача№1')
import numpy as np# импортируем библиотеку
# --# исходные данные myA
myA=np.array([[1.8,1.77,1.48,1.39,1.24,1.3],
              [1.8,1.67,1.97,1.34,1.12,1.32],
              [1.91,1.54,1.49,1.61,1.60,1.43],
              [1.49,1.86,1.36,1.99,1.53,1.85],
              [1.64,1.67,1.74,1.13,1.84,1.52],
              [1.27,1.12,1.80,1.28,1.04,1.67]])
# --# исходные данные myB
myB=np.array([0.75,0.51,0.66,0.58,0.88,0.02])
# --# вывод системы на экран
print(myA[0,],"*X1=",myB[0])
print(myA[1,],"*X2=",myB[1])
print(myA[2,],"*X3=",myB[2])
print(myA[3,],"*X4=",myB[3])
print(myA[4,],"*X5=",myB[4])
print(myA[5,],"*X6=",myB[5])
slv = np.linalg.solve(myA, myB)
print("Решение=", slv)

print('Индивидуальное задание. Задача№2')
import numpy as np# импортируем библиотеку
# --# исходные данные myA
myA=np.array([[1.82,1.78,1.51,1.38,1.03,1.28],
              [1.30,1.27,1.61,1.19,1.85,1.63],
              [1.59,1.30,1.62,1.65,1.69,1.81],
              [1.97,1.12,1.58,1.97,1.65,1.66],
              [1.07,1.08,1.22,1.50,1.57,1.85],
              [1.34,1.23,1.92,1.82,1.57,1.54]])
# --# исходные данные myB
myB=np.array([0.75,0.75,0.62,0.5,0.29,0.76])
# --# вывод системы на экран
print(myA[0,],"*X1=",myB[0])
print(myA[1,],"*X2=",myB[1])
print(myA[2,],"*X3=",myB[2])
print(myA[3,],"*X4=",myB[3])
print(myA[4,],"*X5=",myB[4])
print(myA[5,],"*X6=",myB[5])
slv = np.linalg.solve(myA, myB)
print("Решение=", slv)

print('Индивидуальное задание. Задача№3')
import numpy as np# импортируем библиотеку
# --# исходные данные myA
myA=np.array([[1.68,1.24,1.80,1.62],
              [1.06,1.70,1.83,1.10],
              [1.40,1.13,1.24,1.02],
              [1.58,1.01,1.36,1.93]])
# --# исходные данные myB
myB=np.array([0.67,0.08,0.88,0.4])
# --# вывод системы на экран
print(myA[0,],"*X1=",myB[0])
print(myA[1,],"*X2=",myB[1])
print(myA[2,],"*X3=",myB[2])
print(myA[3,],"*X4=",myB[3])
slv = np.linalg.solve(myA, myB)
print("Решение=", slv)

print('Индивидуальное задание. Задача№4')
import numpy as np# импортируем библиотеку
# --# исходные данные myA
myA=np.array([[1.13,1.58,1.12],[1.88,1.30,1.31],[1.61,1.75,1.67]])
# --# исходные данные myB
myB=np.array([0.06,0.69,0.33])
# --# вывод системы на экран
print(myA[0,],"*X1=",myB[0])
print(myA[1,],"*X2=",myB[1])
print(myA[2,],"*X3=",myB[2])
slv = np.linalg.solve(myA, myB)
print("Решение=", slv)

print('Индивидуальное задание. Задача№5')
import numpy as np# импортируем библиотеку
# --# исходные данные myA
myA=np.array([[1.04,1.25],[1.09,1.17]])
# --# исходные данные myB
myB=np.array([0.44,0.60])
# --# вывод системы на экран
print(myA[0,],"*X1=",myB[0])
print(myA[1,],"*X2=",myB[1])
slv = np.linalg.solve(myA, myB)
print("Решение=", slv)